Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/eusci_uart.c
        assert(
                (EUSCI_UART_MODE == param->uartMode) ||
                (EUSCI_UART_IDLE_LINE_MULTI_PROCESSOR_MODE == param->uartMode) ||
                (EUSCI_UART_ADDRESS_BIT_MULTI_PROCESSOR_MODE == param->uartMode) ||
                (EUSCI_UART_AUTOMATIC_BAUDRATE_DETECTION_MODE == param->uartMode)
                );

        assert(
                (EUSCI_UART_CLOCKSOURCE_ACLK == param->selectClockSource) ||
                (EUSCI_UART_CLOCKSOURCE_SMCLK == param->selectClockSource)
                );

        assert(
                (EUSCI_UART_MSB_FIRST == param->msborLsbFirst) ||
                (EUSCI_UART_LSB_FIRST == param->msborLsbFirst)
                );

        assert(
                (EUSCI_UART_ONE_STOP_BIT == param->numberofStopBits) ||
                (EUSCI_UART_TWO_STOP_BITS == param->numberofStopBits)
                );

        assert(
                (EUSCI_UART_NO_PARITY == param->parity) ||
                (EUSCI_UART_ODD_PARITY == param->parity) ||
                (EUSCI_UART_EVEN_PARITY == param->parity)
                );

        bool retVal = STATUS_SUCCESS;

        //Disable the USCI Module
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= UCSWRST;

        //Clock source select
        HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~UCSSEL_3;
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= param->selectClockSource;

        //MSB, LSB select
        HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~UCMSB;
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= param->msborLsbFirst;

        //UCSPB = 0(1 stop bit) OR 1(2 stop bits)
        HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~UCSPB;
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= param->numberofStopBits;

        //Parity
        switch (param->parity) {
        case EUSCI_UART_NO_PARITY:
                //No Parity
                HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~UCPEN;
                break;
        case EUSCI_UART_ODD_PARITY:
                //Odd Parity
                HWREG16(baseAddress + OFS_UCAxCTLW0) |= UCPEN;
                HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~UCPAR;
                break;
        case EUSCI_UART_EVEN_PARITY:
                //Even Parity
                HWREG16(baseAddress + OFS_UCAxCTLW0) |= UCPEN;
                HWREG16(baseAddress + OFS_UCAxCTLW0) |= UCPAR;
                break;
        }

        //BaudRate Control Register
        HWREG16(baseAddress + OFS_UCAxBRW ) = param->clockPrescalar;
        //Modulation Control Register
        HWREG16(baseAddress + OFS_UCAxMCTLW) = ((param->secondModReg << 8)
                                                + (param->firstModReg << 4) + param->overSampling );

        //Asynchronous mode & 8 bit character select & clear mode
        HWREG16(baseAddress + OFS_UCAxCTLW0) &=  ~(UCSYNC +
                                                   UC7BIT +
                                                   UCMODE_3
                                                   );

        //Configure  UART mode.
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= param->uartMode;

        //Reset UCRXIE, UCBRKIE, UCDORM, UCTXADDR, UCTXBRK
        HWREG16(baseAddress + OFS_UCAxCTLW0)  &= ~(UCRXEIE + UCBRKIE + UCDORM +
                                                   UCTXADDR + UCTXBRK
                                                   );

        return retVal;
}
//*****************************************************************************
//
//! \brief Transmits a byte from the UART Module.
//!
//! This function will place the supplied data into UART transmit data register
//! to start transmission
//!
//! \param baseAddress is the base address of the EUSCI_UART module.
//! \param transmitData data to be transmitted from the UART module
//!
//! Modified bits of \b UCAxTXBUF register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_UART_transmitData( uint16_t baseAddress,
                              uint8_t transmitData
                              )
{
        //If interrupts are not used, poll for flags
        if (!(HWREG16(baseAddress + OFS_UCAxIE) & UCTXIE))
                //Poll for transmit interrupt flag
                while (!(HWREG16(baseAddress + OFS_UCAxIFG) & UCTXIFG)) ;

        HWREG16(baseAddress + OFS_UCAxTXBUF) = transmitData;
}

//*****************************************************************************
//
//! \brief Receives a byte that has been sent to the UART Module.
//!
//! This function reads a byte of data from the UART receive data Register.
//!
//! \param baseAddress is the base address of the EUSCI_UART module.
//!
//! Modified bits of \b UCAxRXBUF register.
//!
//! \return Returns the byte received from by the UART module, cast as an
//!         uint8_t.
//
//*****************************************************************************
uint8_t EUSCI_UART_receiveData(uint16_t baseAddress)
{
        //If interrupts are not used, poll for flags
        if (!(HWREG16(baseAddress + OFS_UCAxIE) & UCRXIE))
                //Poll for receive interrupt flag
                while (!(HWREG16(baseAddress + OFS_UCAxIFG) & UCRXIFG)) ;

        return HWREG16(baseAddress + OFS_UCAxRXBUF);
}

//*****************************************************************************
//
//! \brief Enables individual UART interrupt sources.
//!
//! Enables the indicated UART interrupt sources.  The interrupt flag is first
//! and then the corresponding interrupt is enabled. Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor. Does not clear interrupt flags.
//!
//! \param baseAddress is the base address of the EUSCI_UART module.
//! \param mask is the bit mask of the interrupt sources to be enabled.
//!        Mask value is the logical OR of any of the following:
//!        - \b EUSCI_UART_RECEIVE_INTERRUPT - Receive interrupt
//!        - \b EUSCI_UART_TRANSMIT_INTERRUPT - Transmit interrupt
//!        - \b EUSCI_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT - Receive erroneous-
//!           character interrupt enable
//!        - \b EUSCI_UART_BREAKCHAR_INTERRUPT - Receive break character
//!           interrupt enable
//!        - \b EUSCI_UART_STARTBIT_INTERRUPT - Start bit received interrupt
//!           enable
//!        - \b EUSCI_UART_TRANSMIT_COMPLETE_INTERRUPT - Transmit complete
//!           interrupt enable
//!
//! Modified bits of \b UCAxCTL1 register and bits of \b UCAxIE register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_UART_enableInterrupt(uint16_t baseAddress,
                                uint8_t mask
                                )
{
        assert(!(mask & ~(EUSCI_UART_RECEIVE_INTERRUPT
                          | EUSCI_UART_TRANSMIT_INTERRUPT
                          | EUSCI_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT
                          | EUSCI_UART_BREAKCHAR_INTERRUPT
                          | EUSCI_UART_STARTBIT_INTERRUPT
                          | EUSCI_UART_TRANSMIT_COMPLETE_INTERRUPT)));

        uint8_t locMask;

        locMask = (mask & (EUSCI_UART_RECEIVE_INTERRUPT
                           | EUSCI_UART_TRANSMIT_INTERRUPT
                           | EUSCI_UART_STARTBIT_INTERRUPT
                           | EUSCI_UART_TRANSMIT_COMPLETE_INTERRUPT));

        HWREG16(baseAddress + OFS_UCAxIE) |= locMask;

        locMask = (mask & (EUSCI_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT
                           | EUSCI_UART_BREAKCHAR_INTERRUPT));
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= locMask;

