Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/eusci_uart.c
}

//*****************************************************************************
//
//! \brief Disables individual UART interrupt sources.
//!
//! Disables the indicated UART interrupt sources. Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor.
//!
//! \param baseAddress is the base address of the EUSCI_UART module.
//! \param mask is the bit mask of the interrupt sources to be disabled.
//!        Mask value is the logical OR of any of the following:
//!        - \b EUSCI_UART_RECEIVE_INTERRUPT - Receive interrupt
//!        - \b EUSCI_UART_TRANSMIT_INTERRUPT - Transmit interrupt
//!        - \b EUSCI_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT - Receive erroneous-
//!           character interrupt enable
//!        - \b EUSCI_UART_BREAKCHAR_INTERRUPT - Receive break character
//!           interrupt enable
//!        - \b EUSCI_UART_STARTBIT_INTERRUPT - Start bit received interrupt
//!           enable
//!        - \b EUSCI_UART_TRANSMIT_COMPLETE_INTERRUPT - Transmit complete
//!           interrupt enable
//!
//! Modified bits of \b UCAxCTL1 register and bits of \b UCAxIE register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_UART_disableInterrupt(uint16_t baseAddress,
                                 uint8_t mask
                                 )
{
        assert(!(mask & ~(EUSCI_UART_RECEIVE_INTERRUPT
                          | EUSCI_UART_TRANSMIT_INTERRUPT
                          | EUSCI_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT
                          | EUSCI_UART_BREAKCHAR_INTERRUPT
                          | EUSCI_UART_STARTBIT_INTERRUPT
                          | EUSCI_UART_TRANSMIT_COMPLETE_INTERRUPT)));

        uint8_t locMask;

        locMask = (mask & (EUSCI_UART_RECEIVE_INTERRUPT
                           | EUSCI_UART_TRANSMIT_INTERRUPT
                           | EUSCI_UART_STARTBIT_INTERRUPT
                           | EUSCI_UART_TRANSMIT_COMPLETE_INTERRUPT));
        HWREG16(baseAddress + OFS_UCAxIE) &= ~locMask;


        locMask = (mask & (EUSCI_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT
                           | EUSCI_UART_BREAKCHAR_INTERRUPT));
        HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~locMask;
}

//*****************************************************************************
//
//! \brief Gets the current UART interrupt status.
//!
//! This returns the interrupt status for the UART module based on which flag
//! is passed.
//!
//! \param baseAddress is the base address of the EUSCI_UART module.
//! \param mask is the masked interrupt flag status to be returned.
//!        Mask value is the logical OR of any of the following:
//!        - \b EUSCI_UART_RECEIVE_INTERRUPT_FLAG
//!        - \b EUSCI_UART_TRANSMIT_INTERRUPT_FLAG
//!        - \b EUSCI_UART_STARTBIT_INTERRUPT_FLAG
//!        - \b EUSCI_UART_TRANSMIT_COMPLETE_INTERRUPT_FLAG
//!
//! Modified bits of \b UCAxIFG register.
//!
//! \return Logical OR of any of the following:
//!         - \b EUSCI_UART_RECEIVE_INTERRUPT_FLAG
//!         - \b EUSCI_UART_TRANSMIT_INTERRUPT_FLAG
//!         - \b EUSCI_UART_STARTBIT_INTERRUPT_FLAG
//!         - \b EUSCI_UART_TRANSMIT_COMPLETE_INTERRUPT_FLAG
//!         \n indicating the status of the masked flags
//
//*****************************************************************************
uint8_t EUSCI_UART_getInterruptStatus(uint16_t baseAddress,
                                      uint8_t mask)
{
        assert(!(mask & ~(EUSCI_UART_RECEIVE_INTERRUPT_FLAG
                          | EUSCI_UART_TRANSMIT_INTERRUPT_FLAG
                          | EUSCI_UART_STARTBIT_INTERRUPT_FLAG
                          | EUSCI_UART_TRANSMIT_COMPLETE_INTERRUPT_FLAG)));

        return HWREG16(baseAddress + OFS_UCAxIFG) & mask;
}

//*****************************************************************************
//
//! \brief Clears UART interrupt sources.
//!
//! The UART interrupt source is cleared, so that it no longer asserts. The
//! highest interrupt flag is automatically cleared when an interrupt vector
//! generator is used.
//!
//! \param baseAddress is the base address of the EUSCI_UART module.
//! \param mask is a bit mask of the interrupt sources to be cleared.
//!        Mask value is the logical OR of any of the following:
//!        - \b EUSCI_UART_RECEIVE_INTERRUPT_FLAG
//!        - \b EUSCI_UART_TRANSMIT_INTERRUPT_FLAG
//!        - \b EUSCI_UART_STARTBIT_INTERRUPT_FLAG
//!        - \b EUSCI_UART_TRANSMIT_COMPLETE_INTERRUPT_FLAG
//!
//! Modified bits of \b UCAxIFG register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_UART_clearInterruptFlag(uint16_t baseAddress, uint8_t mask)
{
        assert(!(mask & ~(EUSCI_UART_RECEIVE_INTERRUPT_FLAG
                          | EUSCI_UART_TRANSMIT_INTERRUPT_FLAG
                          | EUSCI_UART_STARTBIT_INTERRUPT_FLAG
                          | EUSCI_UART_TRANSMIT_COMPLETE_INTERRUPT_FLAG)));

        //Clear the UART interrupt source.
        HWREG16(baseAddress + OFS_UCAxIFG) &= ~(mask);
}

//*****************************************************************************
//
//! \brief Enables the UART block.
//!
//! This will enable operation of the UART block.
//!
//! \param baseAddress is the base address of the EUSCI_UART module.
//!
//! Modified bits are \b UCSWRST of \b UCAxCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_UART_enable(uint16_t baseAddress)
{
        //Reset the UCSWRST bit to enable the USCI Module
        HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~(UCSWRST);
}

//*****************************************************************************
//
//! \brief Disables the UART block.
//!
//! This will disable operation of the UART block.
//!
//! \param baseAddress is the base address of the EUSCI_UART module.
//!
//! Modified bits are \b UCSWRST of \b UCAxCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_UART_disable(uint16_t baseAddress)
{
        //Set the UCSWRST bit to disable the USCI Module
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= UCSWRST;
}

//*****************************************************************************
//
//! \brief Gets the current UART status flags.
//!
//! This returns the status for the UART module based on which flag is passed.
//!
//! \param baseAddress is the base address of the EUSCI_UART module.
//! \param mask is the masked interrupt flag status to be returned.
//!        Mask value is the logical OR of any of the following:
//!        - \b EUSCI_UART_LISTEN_ENABLE
//!        - \b EUSCI_UART_FRAMING_ERROR
//!        - \b EUSCI_UART_OVERRUN_ERROR
//!        - \b EUSCI_UART_PARITY_ERROR
//!        - \b EUSCI_UART_BREAK_DETECT
//!        - \b EUSCI_UART_RECEIVE_ERROR
//!        - \b EUSCI_UART_ADDRESS_RECEIVED
//!        - \b EUSCI_UART_IDLELINE
//!        - \b EUSCI_UART_BUSY
//!
//! Modified bits of \b UCAxSTAT register.
//!
//! \return Logical OR of any of the following:
//!         - \b EUSCI_UART_LISTEN_ENABLE
//!         - \b EUSCI_UART_FRAMING_ERROR
//!         - \b EUSCI_UART_OVERRUN_ERROR
//!         - \b EUSCI_UART_PARITY_ERROR
//!         - \b EUSCI_UART_BREAK_DETECT
//!         - \b EUSCI_UART_RECEIVE_ERROR
//!         - \b EUSCI_UART_ADDRESS_RECEIVED
//!         - \b EUSCI_UART_IDLELINE
//!         - \b EUSCI_UART_BUSY
//!         \n indicating the status of the masked interrupt flags
//
//*****************************************************************************
uint8_t EUSCI_UART_queryStatusFlags(uint16_t baseAddress,
                                    uint8_t mask)
{
        assert( 0x00 != mask && (EUSCI_UART_LISTEN_ENABLE +
                                 EUSCI_UART_FRAMING_ERROR +
                                 EUSCI_UART_OVERRUN_ERROR +
                                 EUSCI_UART_PARITY_ERROR +
                                 EUSCI_UART_BREAK_DETECT +
                                 EUSCI_UART_RECEIVE_ERROR +
                                 EUSCI_UART_ADDRESS_RECEIVED +
                                 EUSCI_UART_IDLELINE +
                                 EUSCI_UART_BUSY
                                 ));

        return HWREG16(baseAddress + OFS_UCAxSTATW) & mask;
}

//*****************************************************************************
//
//! \brief Sets the UART module in dormant mode
//!
//! Puts USCI in sleep mode Only characters that are preceded by an idle-line
//! or with address bit set UCRXIFG. In UART mode with automatic baud-rate
//! detection, only the combination of a break and sync field sets UCRXIFG.
//!
//! \param baseAddress is the base address of the EUSCI_UART module.
//!
//! Modified bits of \b UCAxCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_UART_setDormant(uint16_t baseAddress)
{
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= UCDORM;
}

//*****************************************************************************
//
//! \brief Re-enables UART module from dormant mode
//!
//! Not dormant. All received characters set UCRXIFG.
//!
//! \param baseAddress is the base address of the EUSCI_UART module.
//!
//! Modified bits are \b UCDORM of \b UCAxCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_UART_resetDormant(uint16_t baseAddress)
{
        HWREG16(baseAddress + OFS_UCAxCTLW0) &= ~UCDORM;
}

//*****************************************************************************
//
//! \brief Transmits the next byte to be transmitted marked as address
//! depending on selected multiprocessor mode
//!
//! \param baseAddress is the base address of the EUSCI_UART module.
//! \param transmitAddress is the next byte to be transmitted
//!
//! Modified bits of \b UCAxTXBUF register and bits of \b UCAxCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_UART_transmitAddress(uint16_t baseAddress,
                                uint8_t transmitAddress)
{
        //Set UCTXADDR bit
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= UCTXADDR;

        //Place next byte to be sent into the transmit buffer
        HWREG16(baseAddress + OFS_UCAxTXBUF) = transmitAddress;
}

//*****************************************************************************
//
//! \brief Transmit break.
//!
//! Transmits a break with the next write to the transmit buffer. In UART mode
//! with automatic baud-rate detection, EUSCI_UART_AUTOMATICBAUDRATE_SYNC(0x55)
//! must be written into UCAxTXBUF to generate the required break/sync fields.
//! Otherwise, DEFAULT_SYNC(0x00) must be written into the transmit buffer.
//! Also ensures module is ready for transmitting the next data.
//!
//! \param baseAddress is the base address of the EUSCI_UART module.
//!
//! Modified bits of \b UCAxTXBUF register and bits of \b UCAxCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_UART_transmitBreak(uint16_t baseAddress)
{
        //Set UCTXADDR bit
        HWREG16(baseAddress + OFS_UCAxCTLW0) |= UCTXBRK;

        //If current mode is automatic baud-rate detection
        if (EUSCI_UART_AUTOMATIC_BAUDRATE_DETECTION_MODE ==
            (HWREG16(baseAddress + OFS_UCAxCTLW0) &
             EUSCI_UART_AUTOMATIC_BAUDRATE_DETECTION_MODE))
                HWREG16(baseAddress + OFS_UCAxTXBUF) = EUSCI_UART_AUTOMATICBAUDRATE_SYNC;
        else
                HWREG16(baseAddress + OFS_UCAxTXBUF) = DEFAULT_SYNC;

        //If interrupts are not used, poll for flags
        if (!(HWREG16(baseAddress + OFS_UCAxIE) & UCTXIE))
                //Poll for transmit interrupt flag
                while (!(HWREG16(baseAddress + OFS_UCAxIFG) & UCTXIFG)) ;
}

//*****************************************************************************
//
//! \brief Returns the address of the RX Buffer of the UART for the DMA module.
//!
//! Returns the address of the UART RX Buffer. This can be used in conjunction
//! with the DMA to store the received data directly to memory.
//!
//! \param baseAddress is the base address of the EUSCI_UART module.
//!
//! \return Address of RX Buffer
//
//*****************************************************************************
uint32_t EUSCI_UART_getReceiveBufferAddress(uint16_t baseAddress)
{
        return baseAddress + OFS_UCAxRXBUF;
}

//*****************************************************************************
//
//! \brief Returns the address of the TX Buffer of the UART for the DMA module.
//!
//! Returns the address of the UART TX Buffer. This can be used in conjunction
//! with the DMA to obtain transmitted data directly from memory.
//!
//! \param baseAddress is the base address of the EUSCI_UART module.
//!
//! \return Address of TX Buffer
//
//*****************************************************************************
uint32_t EUSCI_UART_getTransmitBufferAddress(uint16_t baseAddress)
{
        return baseAddress + OFS_UCAxTXBUF;
}

//*****************************************************************************
//
//! \brief Sets the deglitch time
//!
//! \param baseAddress is the base address of the EUSCI_UART module.
//! \param deglitchTime is the selected deglitch time
//!        Valid values are:
//!        - \b EUSCI_UART_DEGLITCH_TIME_2ns
//!        - \b EUSCI_UART_DEGLITCH_TIME_50ns
//!        - \b EUSCI_UART_DEGLITCH_TIME_100ns
//!        - \b EUSCI_UART_DEGLITCH_TIME_200ns
//!
//! \return None
//
//*****************************************************************************
void EUSCI_UART_selectDeglitchTime(uint16_t baseAddress,
                                   uint16_t deglitchTime
                                   )
{
        assert((EUSCI_UART_DEGLITCH_TIME_2ns == deglitchTime) ||
               (EUSCI_UART_DEGLITCH_TIME_50ns == deglitchTime) ||
               (EUSCI_UART_DEGLITCH_TIME_100ns == deglitchTime) ||
               (EUSCI_UART_DEGLITCH_TIME_200ns == deglitchTime)
               );

        HWREG16(baseAddress + OFS_UCAxCTLW1) &= ~(UCGLIT1 + UCGLIT0);

        HWREG16(baseAddress + OFS_UCAxCTLW1) |= deglitchTime;
}


#endif
//*****************************************************************************
//
//! Close the doxygen group for eusci_uart_api
//! @}
//
//*****************************************************************************
